/*=============================================================================
  CSS補助としてのJavaScript達
  gar-den.jp等を参考に
=============================================================================*/

/*-----------------------------------------------------------------------------
  機能: 画面スクロール時、active クラス付与
  用途: 固定フッターでの電話番号欄表示など
-----------------------------------------------------------------------------*/
let fixed_footer = () => {
  const $fixed_footer = $('#fixed_footer');
  const trigger_position = 150;
  let   current_position = $(this).scrollTop();

  // 確認用にスクロール量を表示
  console.log(current_position);

  if (current_position > trigger_position) {
    $fixed_footer.addClass('active');
  } else {
    $fixed_footer.removeClass('active');
  }
}

// 画面をスクロールをした際にどの関数を呼ぶか記述する
//-------------------------------------------------------------------------
$(window).scroll(() => {
  fixed_footer();
});

// ページが読み込まれた際にどの関数を呼ぶか記述する
//-------------------------------------------------------------------------
$(window).on("load", () => {
  fixed_footer();
});
